* Stellar Distance Precision
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database extrasolar
:END:

** Modify the distance column in the stars table so that it allows fractional light years to any degree of precision required.


#+BEGIN_SRC sql
  ALTER TABLE stars
    ALTER COLUMN distance TYPE REAL;
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|

** Further Exploration
Assume the stars table already contains one or more rows of data. What will happen when you try to run the above command? To test this, revert the modification and add a row or two of data:
#+BEGIN_SRC sql
  ALTER TABLE stars
  ALTER COLUMN distance TYPE integer;

  INSERT INTO stars (name, distance, spectral_type, companions)
             VALUES ('Alpha Orionis', 643, 'M', 9);

  ALTER TABLE stars
  ALTER COLUMN distance TYPE numeric ;
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|
| INSERT 0 1  |
| ALTER TABLE |

